'''
--------《Python从菜鸟到高手》源代码------------

欧瑞科技版权所有
作者：李宁
如有任何技术问题，请加QQ技术讨论群：264268059    
或关注“极客起源”订阅号或“欧瑞科技”服务号或扫码关注订阅号和服务号，二维码在源代码根目录
如果QQ群已满，请访问https://geekori.com，在右侧查看最新的QQ群，同时可以扫码关注公众号

“欧瑞学院”是欧瑞科技旗下在线IT教育学院，包含大量IT前沿视频课程，
请访问http://geekori.com/edu或关注前面提到的订阅号和服务号，进入移动版的欧瑞学院

“极客题库”是欧瑞科技旗下在线题库，请扫描源代码根目录中的小程序码安装“极客题库”小程序

关于更多信息，请访问下面的页面
https://geekori.com/help/videocourse/readme.html



'''
# 二进制:110011
print(0b110011)

# 八进制：0123
print(0o123)

# 十六进制：0xF15
print(0xF15)

# 十进制转二进制
print(bin(12))

# 二进制转十进制
print(int("10110",2))

# 十六进转十进制
print(int("0xF35AE",16))

# 十进制转十六进制
print(hex(54321))

# 十六进制转二进制
print(bin(0xF012E))

# 二进制转十六进制
print(hex(0b1101101))

# 十进制转八进制
print(oct(1234))

# 八进制转十进制
print(int("76532", 8))